duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
		ppg_retry_left--;
		if(ppg_retry_left == 0)
		{
			str_id = STR_ID_INCONCLUSIVE_AND_RETRY_LATER;
		}
		else
		{
			str_id = STR_ID_INCONCLUSIVE;
		}
		
		LCD_MeasureUniStr(str_id,&w,&h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_ShowUniStrRtoL(BP_NOTIFY_X+(BP_NOTIFY_W+w)/2, BP_NOTIFY_Y, str_id);
		else
	#endif		
			LCD_ShowUniStr(BP_NOTIFY_X+(BP_NOTIFY_W-w)/2, BP_NOTIFY_Y, str_id);

		k_timer_start(&ppg_status_timer, K_SECONDS(5), K_NO_WAIT);
		break;
		
	case PPG_STATUS_NOTIFY:
		LCD_Fill(BP_NOTIFY_X, BP_NOTIFY_Y, BP_NOTIFY_W, BP_NOTIFY_H, BLACK);
		LCD_ShowImage(BP_ICON_X, BP_ICON_Y, IMG_ID_BPT_ANI_3);

		LCD_SetFontSize(FONT_SIZE_52);

		LCD_MeasureUniStr(STR_ID_STAY_STILL_AND_RETRY, &w, &h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_ShowUniStrRtoL(BP_NOTIFY_X+(BP_NOTIFY_W+w)/2, BP_NOTIFY_Y, STR_ID_STAY_STILL_AND_RETRY);
		else
	#endif
			LCD_ShowUniStr(BP_NOTIFY_X+(BP_NOTIFY_W-w)/2, BP_NOTIFY_Y, STR_ID_STAY_STILL_AND_RETRY);

		k_timer_start(&ppg_status_timer, K_SECONDS(5), K_NO_WAIT);
		break;
	}
}

void BPShowStatus(void)
{
	uint16_t w,h;
	uint32_t img_num[10] = {IMG_ID_FONT_42_NUM_0,IMG_ID_FONT_42_NUM_1,IMG_ID_FONT_42_NUM_2,IMG_ID_FONT_42_NUM_3,IMG_ID_FONT_42_NUM_4,
							IMG_ID_FONT_42_NUM_5,IMG_ID_FONT_42_NUM_6,IMG_ID_FONT_42_NUM_7,IMG_ID_FONT_42_NUM_8,IMG_ID_FONT_42_NUM_9};

	LCD_ShowImage(BP_ICON_X, BP_ICON_Y, IMG_ID_BPT_ANI_3);
	LCD_ShowImage(BP_UP_ARRAW_X, BP_UP_ARRAW_Y, IMG_ID_BPT_MAX_REC);
	LCD_ShowImage(BP_DOWN_ARRAW_X, BP_DOWN_ARRAW_Y, IMG_ID_BPT_MIN_REC);

	LCD_SetFontSize(FONT_SIZE_52);

	LCD_MeasureUniStr(STR_ID_BPT, &w, &h);
#ifdef LANGUAGE_AR_ENABLE	
	if(g_language_r2l)
		LCD_ShowUniStrRtoL(BP_NOTIFY_X+(BP_NOTIFY_W+w)/2, BP_NOTIFY_Y, STR_ID_BPT);
	else
#endif		
		LCD_ShowUniStr(BP_NOTIFY_X+(BP_NOTIFY_W-w)/2, BP_NOTIFY_Y, STR_ID_BPT);

	PPGShowBpNumByImg(BP_UP_STR_X, BP_UP_STR_Y, BP_UP_STR_W, BP_UP_STR_H, BP_UP_NUM_W, img_num, IMG_ID_FONT_42_SLASH, last_health.bpt_max);
	PPGShowBpNumByImg(BP_DOWN_STR_X, BP_DOWN_STR_Y, BP_DOWN_STR_W, BP_DOWN_STR_H, BP_DOWN_NUM_W, img_num, IMG_ID_FONT_42_SLASH, last_health.bpt_min);

	k_timer_start(&ppg_status_timer, K_SECONDS(2), K_NO_WAIT);
}

void BPScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_BP].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_BP].status = SCREEN_STATUS_CREATED;

		LCD_Clear(BLACK);
		IdleShowSignal();
		IdleShowNetMode();
		IdleShowBatSoc();
		BPShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_BP].para&SCREEN_EVENT_UPDATE_SIG)
		{
			scr_msg[SCREEN_ID_BP].para &= (~SCREEN_EVENT_UPDATE_SIG);
			IdleShowSignal();
		}
		if(scr_msg[SCREEN_ID_BP].para&SCREEN_EVENT_UPDATE_NET_MODE)
		{
			scr_msg[SCREEN_ID_BP].para &= (~SCREEN_EVENT_UPDATE_NET_MODE);	
			IdleShowNetMode();
		}
		if(scr_msg[SCREEN_ID_BP].para&SCREEN_EVENT_UPDATE_BAT)
		{
			scr_msg[SCREEN_ID_BP].para &= (~SCREEN_EVENT_UPDATE_BAT);
			IdleUpdateBatSoc();
		}
		if(scr_msg[SCREEN_ID_BP].para&SCREEN_EVENT_UPDATE_BP)
		{
			scr_msg[SCREEN_ID_BP].para &= (~SCREEN_EVENT_UPDATE_BP);
			BPUpdateStatus();
		}
		break;
	}
	
	scr_msg[SCREEN_ID_BP].act = SCREEN_ACTION_NO;
}

void ExitBPScreen(void)
{
	k_timer_stop(&mainmenu_timer);
	k_timer_stop(&ppg_status_timer);

	img_index = 0;
	
#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaStop();
#endif

	if(IsInPPGScreen()&&!PPGIsWorkingTiming())
		MenuStopPPG();

	LCD_Set_BL_Mode(LCD_BL_AUTO);
	
	EnterIdleScreen();
}

void EnterBPScreen(void)
{
	if(screen_id == SCREEN_ID_BP)
		return;

	k_timer_stop(&mainmenu_timer);
	k_timer_stop(&ppg_status_timer);
#ifdef CONFIG_TEMP_SUPPORT
	k_timer_stop(&temp_status_timer);
#endif

#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaStop();
#endif
	if(IsInPPGScreen()&&!PPGIsWorkingTiming())
		MenuStopPPG();

	LCD_Set_BL_Mode(LCD_BL_ALWAYS_ON);

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_BP;	
	scr_msg[SCREEN_ID_BP].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_BP].status = SCREEN_STATUS_CREATING;

	get_bpt_ok_flag = false;
	img_index = 0;
	g_ppg_status = PPG_STATUS_PREPARE;
	ppg_retry_left = 2;

#ifdef CONFIG_ECG_SUPPORT
	SetLeftKeyUpHandler(EnterEcgScreen);
#elif defined(CONFIG_SYNC_SUPPORT)
	SetLeftKeyUpHandler(EnterSyncDataScreen);
#else
	SetLeftKeyUpHandler(EnterSettings);
#endif
	SetRightKeyUpHandler(ExitBPScreen);

#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();

 #ifdef CONFIG_ECG_SUPPORT
 	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterEcgScreen);
 #elif defined(CONFIG_SYNC_SUPPORT)
 	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterSyncDataScreen);
 #else
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterSettings); 
 #endif
 
 	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterSPO2Screen);
#endif
}

void SPO2UpdateStatus(void)
{
	uint8_t i,spo2=g_spo2,count=1;
	uint16_t w,h;
	uint16_t str_id;
	uint32_t divisor=10;
	uint32_t img_anima[3] = {IMG_ID_SPO2_ANI_1, IMG_ID_SPO2_ANI_2, IMG_ID_SPO2_ANI_3};
	uint32_t img_num[10] = {IMG_ID_FONT_60_NUM_0,IMG_ID_FONT_60_NUM_1,IMG_ID_FONT_60_NUM_2,IMG_ID_FONT_60_NUM_3,IMG_ID_FONT_60_NUM_4,
							IMG_ID_FONT_60_NUM_5,IMG_ID_FONT_60_NUM_6,IMG_ID_FONT_60_NUM_7,IMG_ID_FONT_60_NUM_8,IMG_ID_FONT_60_NUM_9};
	uint32_t img_small_num[10] = {IMG_ID_FONT_42_NUM_0,IMG_ID_FONT_42_NUM_1,IMG_ID_FONT_42_NUM_2,IMG_ID_FONT_42_NUM_3,IMG_ID_FONT_42_NUM_4,
								  IMG_ID_FONT_42_NUM_5,IMG_ID_FONT_42_NUM_6,IMG_ID_FONT_42_NUM_7,IMG_ID_FONT_42_NUM_8,IMG_ID_FONT_42_NUM_9};

	switch(g_ppg_status)
	{
	case PPG_STATUS_PREPARE:
		LCD_Fill(SPO2_NOTIFY_X, SPO2_NOTIFY_Y, SPO2_NOTIFY_W, SPO2_NOTIFY_H, BLACK);
		
		LCD_SetFontSize(FONT_SIZE_52);

		LCD_MeasureUniStr(STR_ID_STAY_STILL, &w, &h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_ShowUniStrRtoL(SPO2_NOTIFY_X+(SPO2_NOTIFY_W+w)/2, SPO2_NOTIFY_Y, STR_ID_STAY_STILL);
		else
	#endif		
			LCD_ShowUniStr(SPO2_NOTIFY_X+(SPO2_NOTIFY_W-w)/2, SPO2_NOTIFY_Y, STR_ID_STAY_STILL);
		
